app/views/songs/show.html.erb

<h1><%= link_to @song.title, song_path(@song) %></h1>
<% if @song.artist.present? %>
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 24]]